{
  "header": {
    "link1": "Use cases",
    "link2": "Features",
    "link3": "How to use",
    "link4": "Resources",
    "link5": "Company",
    "link6": "Contact us",
    "buttonSignin": "Sign in"
  },
  "footer": {
    "information": "Information",
    "socials": "Socials",
    "contacts": "Contact us",
    "office": "Office"
  },
  "mainHero": {
    "control1": "Improved cashflow",
    "control2": "Trustable network",
    "control3": "Secure collaboration",
    "control4": "Paperless trade",
    "control5": "Traceable supply chain",
    "heading-slide1": "Buy and sell commodities quicker and with reduced risk",
    "heading-slide2": "Eradicate frauds, inefficiencies and exploitation from international trade",
    "heading-slide3": "Accurately track contractual performances throughout the entire cargo journey ",
    "heading-slide4": "Digitize bill of ladings, transportation, and sales agreements for higher operational efficiency",
    "heading-slide5": "Keep suppliers accountable and compliant with supply chain labor regulations"
  },
  "mainServices": {
    "subtitle": "End-to-end paperless workflows",
    "title": "Our services",
    "text": "All of our services come integrated on the Secro cloud-based platform: different teams and organizations can use them to securely collaborate and efficiently perform all the functions needed to negotiate, sign, finance, execute and audit the most complex cross-border supply chain operations. We Increase trust, reduce risk and make global trade more equitable for everyone.",
    "button": "View all features",
    "listButton": "Learn more",
    "list1": {
      "title": "e-Bill of Lading",
      "text": "Secro e-Bill (TM) is a new-generation electronic bill of lading. It allows parties to perform all the functions of a paper bill of lading with increased speed, lower cost and unmatched security without the need of a private agreement"
    },
    "list2": {
      "title": "Supply Chain Financing",
      "text": "Secro enables access to competitive financing solutions with a streamlined, digital process that is cheaper and more flexible than traditional bank-based relationships\n"
    },
    "list3": {
      "title": "Notary",
      "text": "The Secro notary service allows to instantaneously verify the authenticity and latest version of every document generated through the Secro application, by simply scanning a QR code "
    },
    "list4": {
      "title": "COLLABORATE WITHIN THE PLATFORM",
      "text": "Share within you organization and with your trusted trading partners information and documents to expedite your transactions, while still protecting confidentiality and data security"
    },
    "list5": {
      "title": "Treasury",
      "text": "Secro enables you to send and receive payments in a safer way, thanks to the most advanced KYC, KYB, AML and bank account verification technologies. We also offer Money Escrow services for Claims and S&P transactions"
    },
    "list6": {
      "title": "Claims arbitration",
      "text": "Secro allows parties to manage claims and litigation with clear timelines and legal costs. We help you to negotiate, mediate and arbitrate claims of any size thanks to clear, pre-agreed rules, automated workflows and our experienced legal team"
    }
  },
  "mainPerform": {
    "title": "END-TO-END CONTRACT DELIVERY",
    "text": "Secro complements and augments your existing ERPs and TMS by managing processes and protecting critical business data that today are left on paper or administered via off-line systems. This will give you unprecedented visibility and control over your financial, commercial and legal workstreams."
  },
  "mainDifference": {
    "title": "Why We are different",
    "slide1": {
      "title": "Technology",
      "text": "Secro uses the most advanced technology to vet customers, protect data, prevent frauds, detect suspicious behaviors and ensure maximum confidentiality. We use bank-grade, state of the art KYC, KYB and AML verification."
    },
    "slide2": {
      "title": "Collaborative network",
      "text": "Secro provides a secure, vetted network that trading partners can join for free. The onboarding process is seamless and terms and conditions are straightforward. Secro e-bill of lading is legally recognized globally and does not require cumbersome, upfront private agreements, substantially simplifying compliance and expediting critical business flows between traders, carriers, banks and their customers"
    },
    "slide3": {
      "title": "Trust",
      "text": "Secro is built in full compliance with the latest digital trade laws and regulations. We built a technology that fully meets the requirements of international regulatory bodies, insurance carriers and trade associations"
    }
  },
  "mainVideo": {
    "title": "Video overview",
    "text": "Video overview of how Secro transforms cross-border trade"
  },
  "mainPartnersCustomers": {
    "title": "SECRO TRUSTED NETWORK",
    "text": "Secro uses the most advanced technology to vet customers, protect data, prevent frauds, detect suspicious behaviors and ensure maximum confidentiality."
  },
  "solutions": {
    "title:": "Solutions"
  },
  "useCases": {
    "title": "Use cases",
    "text": "Secro helps organizations and individuals to solve complex challenges in a collaborative, cost-efficient way. The flexibility and user-friendliness of our technology allows quick adoption and scalability across multiple industries and use cases",
    "column1Title": "Use cases",
    "column2Title": "Secro added value",
    "case1": {
      "caseTitle": "paperless e-Bill of Lading",
      "caseText": "Paper bills are expensive and increase legal and operational risk. They are not flexible enough to support time-sensitive commercial and operational processes, such as changes of destination or in-transit sales, and thereby preclude many business opportunities. Secro e-BL ™ is a new-generation digital bill of lading that overcomes the inefficient and costly limitations of paper bills.",
      "result1Title": "Operate e-BL securely",
      "result1Text": "Draft, sign, release, split, endorse and transfer digital documents of title securely via Secro Vault ™. Thanks to Secro compliance with the most advanced legislations on digital negotiable instruments.",
      "result2Title": "Frictionless trade",
      "result2Text": "Secro e-BL ™ does not require private agreements and restrictive covenants. Shippers, carriers, consignees can safely transfer cargo ownership and other rights using our web application, from anywhere in the world, with few clicks at competitive costs."
    },
    "case2": {
      "caseTitle": "Contract lifecycle management",
      "caseText": "Emails, phone calls, paper documents or siloed software are the way companies compose, negotiate and sign contracts. Manual processes leave room for errors, unsecure communication tools can lead to data breach and fraud, and shipping physical documents is inefficient, slow and expensive.",
      "result1Title": "Collaborate effectively",
      "result1Text": "Secro enables globally dispersed teams to cooperate securely and effectively to execute international transactions. Negotiate and sign securely in a collaborative environment that allows parties to quickly and safely exchange information and supporting documents.",
      "result2Title": "Keep your business safe",
      "result2Text": "Set up approval workflows to ensure proper due diligence is in place and mitigate human errors. Store drafts and executed documents on the cloud, keeping critical business information secure and confidential with military-grade level protection."
    },
    "case3": {
      "caseTitle": "Contract performance automation",
      "caseText": "Parties privy to multiple contracts have no organized and automated way to check that all the boxes have been ticked for the execution of a transaction. Manual workflows and unstandardized procedures make it difficult to figure out financial, legal and contractual dependencies between transportation contracts, sales & purchase agreement and bills of lading. Errors, underperfomances and frauds often go unnoticed.",
      "result1Title": "Smart contract execution",
      "result1Text": "Secro translate contracts into smart workflows, where a sequence of well-defined, measurable events must be executed and then validated in order to trigger the fulfilment of contractual clauses. Dependencies between multiple documents and transactions are automatically detected by Secro allowing for more informed decision making and an increased awareness of any potential legal or operational issues. Our secure, online collaboration platform then allows stakeholders to confirm the execution of events, as well as upload  documentation to authenticate this.",
      "result2Title": "Quick problem solving",
      "result2Text": "No error goes unnoticed thanks to intuitive interface and instant email notifications. Our secure in-app chat allows a direct communication channel between parties to solve any errors or possible underperfomances quickly. The entire process happens on our secure web application, reducing the risk of data breach and fraud."
    },
    "case4": {
      "caseTitle": "Auding and compliance ",
      "caseText": "Companies are required to capture,  store and audit an increasing amount of data and documentation to comply with international regulations such as IMO2023, initiatives like the Climate Pledge or domestic laws such as Germany’s Mandatory human rights due diligence law. This process is extremely expensive and time consuming unless companies implement an automated process to collect the required data when they engage in commercial transactions. Moreover, the process is complicated further by the fact that the format of data and documents is usually inconsistent and not suitable to automated auditing and analysis processes.",
      "result1Title": "Performance monitoring",
      "result1Text": "When a contract of any kind is executed on Secro, our technology automatically captures all of the data, documentation and action logs critical to achieve a successful audit. Additionally, our collaborative platform can be used to evidence compliance with specific laws, regulations and standards during the contract execution phase.",
      "result2Title": "Keep workflows organized",
      "result2Text": "Since the process happens automatically, there is no additional workload on the operation teams who are executing the contract. Secro takes care to ask the right questions to your trading partners, customers and suppliers, and safely stores and organises all of the relevant information."
    },
    "case5": {
      "caseTitle": "Claims negotiation, mediation and arbitration",
      "caseText": "Litigation ensues after almost 5% of cross-border transactions. Legal claims often lead to extensive delays, especially where documents and information is not stored and organised. An award and legal costs can therefore easily reach into the millions of dollars, leading to substantial costs increases for interest on claims principals, and bad debt.",
      "result1Title": "Pre-agreed arbitration",
      "result1Text": "Claimants opening a claim on Secro can take advantage of pre-agreed arbitration rules and an automated collection of disclosures and back up documentation. This substantially reduces the time needed to comply with legal processes like discovery, such that an award can be obtained or a settlement can be reached in a shorter time period.",
      "result2Title": "Claim resolution accelerated",
      "result2Text": "Our collaborative web application connects claimants with mediators, technical experts, and arbitrators who can be hired to solve disputes at known fees. As a result, legal costs are reduced and claims resolution is accelerated, meaning less cash remains immobilized by litigation."
    },
    "case6": {
      "caseTitle": "Supply chain finance",
      "caseText": "The connection between businesses and capital providers is often strained and  inefficient. It is difficult even for established companies to gain the trust of lenders, especially when penetrating new markets. This is because traditional guarantees like letters of credit are not always reliable, and banks dispute their validity in case of a borrower’s default, creating big risks for trading partners. On the other hand, financial entities often struggle to collect all the financial disclosures and insights they need to lend capital. As a result, they either have to absorb the risk and charge a higher interest rate or give up on lending opportunities",
      "result1Title": "Supply chain finance options for borrowers",
      "result1Text": "Secro provides an additional layer of connection between lenders and borrowers to increase trust. We achieve this by establishing a robust platform where all the parties privy to a transaction are able to be screened with state of the art KYC, KYB, and AML processes. Additionally, our bank account verification procedure confidentially gains up-front financial disclosures indicative of a company's financial health. This provides lenders with a better way to validate information and assess potential customers, and borrowers with increased access to competitive sources of supply chain financing.",
      "result2Title": "Transparency for lenders",
      "result2Text": "Secro enables parties to spot red flags and potential frauds at every step of the contract execution process (such as double consignments or buyer-seller collusions). Moreover, our screening tools and contract monitoring capabilities establish individual and organizational accountability, deterring fraudulent behaviors. Above all, by establishing a transparent yet highly confidential way to surface credit-related information, we foster a network where only trustable and financially reliable entities are allowed to contract with trading partners and lenders."
    },
    "case7": {
      "caseTitle": "Treasury: Global payments and escrow",
      "caseText": "Both in cash-on-delivery and open account scenarios, companies are using archaic and unreliable ways to internally coordinate and then execute payments. Finance, operations and accounting teams frequently use unsecured emails, chat applications and phone calls between them and with external parties (banks, customers, providers). This disconnected, unsecure and uncoordinated process creates a massive risk for human error and exposes companies to phishing, reverse social engineering and scamming attacks. And once payment is made to an incorrect or fraudulent party, there is a very low likelihood of recovery.",
      "result1Title": "Safer financial workflows",
      "result1Text": "Secro brings all the loose ends together on a secure platform where multiple teams across different organizations can engage in trustworthy communications. Encrypted chatrooms, secure document repositories, and approval workflows allow parties to interact effectively to reduce the risk of human errors and fraud. Visibility over the actual execution of contractual clauses helps synchronize the work of financial, accounting and operation teams, so the decision to trigger a payment is taken only when all the boxes are ticked.",
      "result2Title": "Payments execution",
      "result2Text": "Customers can also connect their bank account to Secro's global payment service, allowing them to execute payments in multiple currencies straight on our secure platform. This eliminates potential sources of data leaks, phishing and fraud. Finally, a money escrow service is offered to facilitate cash-on-delivery transactions."
    }
  },
  "requestDemo": {
    "title": "REQUEST DEMO",
    "description": "Please fill the form below and our team will be in touch shortly to schedule a demo.",
    "success": {
      "title": "Dear",
      "text": "Thanks for your interest in Secro. We confirm we received your request and one member of our team will be in touch shortly to schedule a demo."
    }
  },
  "contactSales": {
    "title": "CONTACT SALES",
    "description": "Of course, deeply understanding your users and their needs is the foundation of any good product.",
    "success": "Message was successfully sent"
  },
  "common": {
    "form": {
      "label": {
        "fullName": "Full name",
        "company": "Company",
        "companyWebsite": "Company website",
        "businessEmail": "Business E-mail",
        "jobRole": "Job role",
        "employees": "Employees",
        "country": "Country",
        "phone": "Phone",
        "name": "Name",
        "e-mail": "E-mail",
        "title": "Title",
        "message": "Message"
      },
      "placeholder": {},
      "allFieldsRequired": "All fields are required"
    },
    "button": {
      "close": "Close",
      "cancel": "Cancel",
      "submitRequest": "Submit request",
      "requestDemo": "Request demo",
      "contactSales": "Contact sales"
    },
    "bottomBanner": {
      "haveQuestions": "Have any questions?",
      "letsDiscuss": "Let’s discuss",
      "contactUs": "Contact us",
      "happyDiscuss": "We are happy to discuss it",
      "aboutFeatures": "Want to know more about features?",
      "vision": "Our vision is to",
      "globalTrade": "Enable frictionless global trade",
      "letsTalk": "Lets talk about it",
      "featuresTitle": "Have any questions?",
      "empty": " "
    },
    "readBio": "Read bio",
    "errors": {
      "default": "Something went wrong. Please try again later"
    }
  },
  "features": {
    "title": "Features",
    "description": "Actual events, evidence of performance and financial flows are all synchronized.",
    "templates": {
      "title": "Customizable templates",
      "description": "Secro provides parties with customizable templates for fast and smart contract creation."
    },
    "secure": {
      "title": "Secure online collaboration",
      "description": "Legal and commercial teams  collaborate securely online, and cooperate closely with operations teams, through advanced tools such as a secure chat function and process flows automation."
    },
    "digital": {
      "title": "Digitally sign contracts",
      "description": "Robust KYC, KYB, AML services, bank-grade data security and encrypted storage provide a secure platform where deals can be executed efficiently."
    },
    "clauses": {
      "title": "Digital clauses",
      "description": "Contract Managers can easily translate legal clauses into digital workflows, and assign individual entities to complete specific steps that leads to the fulfilment of the contract. Multiple parties can then access Secro to confirm or deny the fulfilment of events like cargo delivery or payments."
    },
    "eBill": {
      "title": "e-Bill of Lading",
      "description": "For the first time, Secro e-Bill of Lading provides the ability to replicate all the functions of a paper bill of lading in full compliance with a robust legal framework. There is no need for any private agreement or punitive covenants."
    },
    "cashFlow": {
      "title": "Improved cashflow",
      "description1": "Secro's pre-agreed arbitration rules and online claims management process provide increased certainty over the cost and timeframe of dispute resolution. Secro also connects its customers with insurance providers to increase the protection of your investment into sales and purchase or service agreements.",
      "description2": "Secro Treasury allows secure global payments and provides an escrow service to ensure more visibility and control of transactions."
    }
  },
  "company": {
    "title": "ENABLING FRICTIONLESS GLOBAL TRADE",
    "description": "Secro fosters, builds and secures trust between trading partners by creating opportunities to grow commercial relationships.",
    "story": {
      "title": "OUR STORY",
      "description1": "Secro came from a pragmatic idea three maritime industry veterans had in 2016 who simply thought, “there must be a better way.” With an ongoing dream and ambition, they assembled a global team of experts in cloud technology, supply chain management, international trade and maritime law, SaaS start-up entrepreneurship, finance and banking, and digital strategy.",
      "description2": "",
      "description3": "We are not claiming to be the next disruptive startup and yet, the unparalleled simplicity and intuitiveness of the platform speak for itself. As we focus our time and resources on our customers, the goal continues to remove inefficiency and establish trust between trading partners to facilitate cross-border commerce and financial transactions, while protecting confidentiality as job one.​",
      "end": "“The current way of doing business cross-border is simply unfair. Too much value is ripped off by middlemen and inefficiency, not to mention the risk of frauds that companies are facing. Secro will change this status quo. Think of what Uber did in the mobility industry and Amazon in retail. Our ambition is to deliver the same level of transparency in the largest industry on earth, making our customers’ business thrive”",
      "author": "Michele Sancricca, Co-founder and CEO"
    },
    "values": {
      "title": "OUR CORE VALUES",
      "description": "We believe that our vision could not be achieved without promoting in the first instance a company culture funded on trust, respect and transparency. What brought together our core team, aside from a great vision, is that we all intimately share these tenets:",
      "rows": {
        "customer": {
          "title": "Customers",
          "description": "Customers are our priority"
        },
        "resource": {
          "title": "Resources",
          "description": "Our employees are at the core of our success and we believe and invest in their growth"
        },
        "community": {
          "title": "Community",
          "description": "With our platform, we can level the playing field and allow communities around the world to be take part in global trade"
        },
        "trade": {
          "title": "Global trade",
          "description": "We want to provide transparency and equity to sophisticated global networks"
        },
        "technology": {
          "title": "Technologies",
          "description": "We want to democratize access to our technology and services to benefit all potential customers"
        }
      }
    },




    "planning": {
      "title": "A UNIQUE COMBINATION OF TECHNOLOGY, LEGAL AND INDUSTRY EXPERTISE",
      "description1": "Our team is comprised of worldclass technology, legal and industry veterans that bring a unique mix of diversified competences and experiences. Our passion and commitment to the industry fostered over the years has brought us together and made a cohesive team.",
      "description2": "We believe that the same trust and respect we have internally, should be mirrored towards our customers and partners. As we deliver cutting edge technology, we look forward to building long lasting, successful relationships with our customers and partners alike."
    },
    "history": {
      "title": "OUR PAST, PRESENT AND FUTURE",
      "description": "With the goal of expanding our portfolio of services and growing our business across multiple industries, we are executing on an ambitious roadmap. We see our trajectory making us the leader in cross border trade digitization."
    },
    "team": {
      "title": "Core Team",
      "people": {
        "michele": {
          "name": "michele sancricca",
          "role": "Co Founder and CEO",
          "bio": "Michele Sancricca is the co-founder and CEO of Secro Inc. Former Global Head for supply chain and logistics for AWS, Michele previously worked also in the capacity of Head of Supply Chain Products for Amazon Global Mile and as Director of Digital Transformation for MSC (the largest ocean carrier in the world). {br} {br} Michele has extensive experience in delivering complex projects and technology platforms in the space of global supply chains. He built from scratch and led multiple, successful teams both in public companies and in the military. Michele is a retired Lieutenant Commander of the Italian Navy who served in active duty onboard carriers, destroyers and frigates.",
          "linkedin": "https://www.linkedin.com/in/michelesancricca/"
        },
        "piotr": {
          "name": "Piotr Cichocki",
          "role": "Managing Director Europe",
          "bio": "Managing Director, EMEA Former President of Polsteam USA. From ship chartering to ship management to port management to company management to M&A transaction management. {br} {br} Piotr is an open minded, disciplined, restless team player and maritime expert. Over 22 years of experience in various management positions with a major integrated dry bulk shipowner. Last 3 years in restructuring and M&A managerial position with a major Polish Stock Exchange listed logistics and transportation capital group. {br} {br} Currently in investment advisory position with biggest Polish shipowner.",
          "linkedin": "https://www.linkedin.com/in/piotr-cichocki-b3641886/"
        },
        "alexey": {
          "name": "Aleksey Kucherov",
          "role": "Head of Engineering",
          "bio": "Poland based, Aleksey has over 13 years of practice in tech development. His sophisticated and complex experience in the financial sector, marketing, blockchain, data collection and high load processing and supply chain have led him to be the head of engineer in various capacities. {br} {br} Highly notable areas of expertise are his involvement in design of custom protocols, process execution and data transfer optimization. He has an MSc in Data security, and as such, his passion and priorities revolve around it. His vast knowledge allows him to easily navigate the complexities of  leading a highly advanced team within the tech sector. This also motivates him to continue expanding his knowledge while mentoring and coaching his team members.",
          "linkedin": "https://www.linkedin.com/in/aleksey-kucherov/"
        },
        "viktor": {
          "name": "Viktor Mikulin",
          "role": "Technical Product Manager",
          "bio": "Technical Product Manager with 12 years diversified domain knowledge (logistics, fintech, renewables, healthcare, construction etc.). Have MSc in Computer Science from National Technical University of Ukraine and MSc in Finance from National Economic University of Ukraine. {br} {br} Viktor is proactive, open to inspection and adoption, structure-minded, disciplined and passionate about new approaches with smooth practicing. Last 4 years he has been focusing exceptionally on developing tech products. He has been a part of Secro team from inception.",
          "linkedin": "https://www.linkedin.com/in/viktor-mikulin-a057711b0/"
        },
        "monika": {
          "name": "Monika Wisniowska",
          "role": "Director Client Success",
          "bio": "Chicago based, Monika started her professional career at Mediterranean Shipping Company in 2008 where she held several different roles within documentation and commercial departments. {br} {br} The knowledge and experience she gained at MSC helped her build a strong foundation for her next role as Director of Operations within a paper trading company. She then, joined a fintech company, Onbe as a Senior Account Manager, overseeing a diverse portfolio of clients with global accounts. She then took on the role of Director of Client Success, leading a team of nine high-performing managers and specialists, with a portfolio of 80+ client accounts. In her previous endeavor in fintech, she was tasked to build the new company role of Technical Program Manager, overseeing a development of an enterprise platform of the two merged companies. Her Industry experience, combined with the extended customer relationship management and product development paved my way out to Secro",
          "linkedin": "https://www.linkedin.com/in/monikawisniowska/"
        },
        "dascka": {
          "name": "Dascka Serrano",
          "role": "Director of Operations",
          "bio": "New York based, Dascka has over 13 years of various management positions and her experience includes maritime logistics, project management, human capital, key accounts management, and organizational transformation. {br} {br} Throughout her tenure, her role also included mentoring to young professionals, managing and leading organizational changes on a nationwide scale. Dascka obtained her Bachelor of Science in International Business from Rutgers University. As she started her career with MSC (the largest ocean carrier in the world), she held both administrative and managerial roles working directly with C+ level executives while overseeing and managing the NY headquarters and later the Chicago office with 270 and 140 employees respectively at the time. She also held a HRBP leadership role that encompassed 4 different locations /business areas across the East coast (responsible for 26% of human capital nationwide) and provided support and guidance to both operational and commercial areas to meet respective organizational goals.",
          "linkedin": "https://www.linkedin.com/in/Dascka/"
        },
        "audun": {
          "name": "Audun Mikalsen",
          "role": "Director of Business Development",
          "bio": "Audun has more than 25 years of experience in the maritime industry and started his professional career working as a ship agent in the then family-owned ship agency business in Norway, founded by his great-grandfather back in 1917. He also trained and worked as a commercial diver and diving instructor before serving in the Royal Norwegian Navy. Later he moved on to international business development and sales of ship agency, logistics, maritime security and digital navigation (SaaS) solutions to ship managers located worldwide. This included building up and managing networks of sales agents and distributors across Latin America, Africa and the Middle East. Audun has first-hand experience of helping ship managers seamlessly move from paper to digital charts and logbooks and is now — as part of the Secro team — keen to help businesses on their digitisation journey when they move away from physical trade documentation. Audun is a Fellow of the Royal Geographical Society and a University of Cambridge alumnus with a Master of Philosophy degree in Latin American Studies.",
          "linkedin": "https://www.linkedin.com/in/audunmikalsen/"
        }
      }
    },
    "advisor": {
      "titleDirectors": "Board of Directors",
      "titleAdvisors": "Advisors",
      "people": {
        "jeff": {
          "name": "Jeff Conway",
          "role": "Independent Director of the Board",
          "bio": "Advisor Jeff Conway is a financial services leader, board director, and business advisor with a long tenure and legacy at State Street Corporation and, most recently, HSBC Group for driving strategic growth and organizational transformations. {br} {br} Recognized for his ability to transform the organization’s most critical business issues through the coupling of strategy and outstanding execution, Jeff has enjoyed success in creating groundbreaking client experience transformations and digital technology change worldwide. Previously, Jeff was the Non-Executive Chairman at Universal Investment Group, a European based investment company, and served on the Board of Directors for Mercatus, a software provider of private market investment solutions, as well as the Advisor Board of Quantexa, a contextual decisioning technology. At HSBC, Jeff was the Global Chief Operating Officer for the Investment and Commercial Banksin support of $20B annual revenues with oversight of over 25,000 employees globally and a technology spend of $5billion per annum.",
          "linkedin": "https://www.linkedin.com/in/jeffdconway/"
        },
        "michele": {
          "name": "Michele Sancricca",
          "role": "Co-founder and CEO",
          "bio": "Michele Sancricca is the co-founder and CEO of Secro Inc. Former Global Head for supply chain and logistics for AWS, Michele previously worked also in the capacity of Head of Supply Chain Products for Amazon Global Mile and as Director of Digital Transformation for MSC (the largest ocean carrier in the world). {br} {br} Michele has extensive experience in delivering complex projects and technology platforms in the space of global supply chains. He built from scratch and led multiple, successful teams both in public companies and in the military. Michele is a retired Lieutenant Commander of the Italian Navy who served in active duty onboard carriers, destroyers and frigates.",
          "linkedin": "https://www.linkedin.com/in/michelesancricca/"
        },
        "sonali": {
          "name": "Sonali Vijayavargiya",
          "role": "Director of the Board",
          "bio": "Sonali is Founder and Managing Partner of Augment Ventures. Augment invests in early-stage B2B SaaS companies creating digital and data automation products to transform traditional industries making them more efficient, productive, and sustainable. {br} {br} Recent successes in her portfolio include AI-based supply chain software company, LLamasoft that was sold for $1.5 Billion to Coupa Software. Over the last 25 years, Sonali has worked with several successful entrepreneurs and mentored many teams to turn new ideas into reality. Prior to starting her VC career, she worked in India with IDBI, PwC and Edelweiss, taking companies to NASDAQ and Bombay Stock Exchange. Sonali serves/has served on the Boards of Rivet, Crowdz, Flume, Perennial, Akitra, Conversight.ai, Mercatus, Fluree, and LLamasoft. She is advisor to the Zell Lurie Commercialization Fund at the University of Michigan Ross Business School.",
          "linkedin": "https://www.linkedin.com/in/augmentventures/"
        },
        "luke": {
          "name": "Luke Zadkovich",
          "role": "Co-founder, Non-Executive Director",
          "bio": "Luke is an attorney at law who co-founded ZFZ, a successful global law firm focused primarily on international trade. He brings an extensive network spanning the cross-border trade industry, and in-depth expertise as international commercial lawyer, English solicitor advocate, New York attorney, and Australian (NSW) solicitor. {br} {br} Luke holds a Master of Laws (LLM) - International Business Law from the King’s College of London, and a Bachelor of Laws (Hons) / Bachelor of Politics (Dist.) from the University of Wollongong. Luke’s LLM dissertation (written over 12 years ago) focused on moving paper-based commodity trading to electronic platforms, and the legal challenges involved. His passion for this business is deep-seated. Luke splits his time between New York, London and Panama.",
          "linkedin": "https://www.linkedin.com/in/luke-zadkovich-a24a7697/"
        },

        "edward_f": {
          "name": "Edward Floyd",
          "role": "Co-founder and Advisor",
          "bio": "NYC-based, Ed co-founded ZFZ with Luke. He is a commercial litigator with extensive experience representing clients in connection with complex disputes involving maritime transportation, the commodities trading industry, and other international and domestic matters. {br} {br} Ed is admitted as a New York and New Jersey attorney and an English solicitor. Ed holds a Juris Doctor degree from Fordham University and a MS from the US Naval Academy. He served as an Officer with the US Marine Corps.",
          "linkedin": "https://www.linkedin.com/in/edward-floyd-9121289/"
        },
        "gregory_o": {
          "name": "Gregory Otto",
          "role": "Advisor and angel investor",
          "bio": "Greg is the CEO of Seapath. Prior to this role, he worked on several maritime entrepreneurial endeavors and before that in various maritime-centric roles at the U.S. Department of State. He is also a U.S. Navy Reserve Officer and holds a valid unlimited tonnage U.S. Coast Guard third officer’s license. {br} {br} Greg is an angel investor and board advisor to Secro, a cross-border trade tech and financing company, and a board of directors member at HarborRock, a sustainable sediment management company. Greg has a B.S. in Intermodal Logistics from the U.S. Merchant Marine Academy, an M.A. in National Security & Strategy from the U.S. Navy War College, and an Executive MBA from Saïd Business School at Oxford University.",
          "linkedin": "https://www.linkedin.com/in/gregory-otto/"
        },
        "nick_t": {
          "name": "Nick Taranto",
          "role": "Advisor and angel investor",
          "bio": "Nick is an entrepreneur, company builder, and early-stage investor. Early on in his career, he started the ecommerce business, Plated. {br} {br} In less than five years, after starting with only 1 cofounder, Nick and the team scaled to over 1,000 employees and went from zero to $150M in revenue. He then, sold his first venture-backed company to Albertsons in 2017. {br} {br} He is a graduate of Harvard Business School, and served as an Infantry Officer in the US Marine Corps. He now lives in Santa Monica, California with his family",
          "linkedin": "https://www.linkedin.com/in/nicktaranto/"
        },
        "robert_s": {
          "name": "Robert Sacco",
          "role": "Advisor",
          "bio": "Bob was IBM Managing Director, Finance Sector, prior to that VP, Financial Services Sector, and Principal and Founding Partner, IBM Supply Chain Solutions where he led the sales and marketing effort to launch global supply chain solution start-up business with branded application software and services. {br} {br} Bob grew global accounts as a rainmaker, player-coach, and trusted advisor, constructing multifaceted win-win agreements that drove high client value by deeply understanding client business needs and pain points, leveraging the organization’s portfolio of offerings, and aligning with client strategic priorities to deliver committed outcomes. He works with the Fortune 500 as well as emerging technology firms looking to penetrate new markets, grow and expand their customer base. He has led the design and deployment of sales transformation initiatives, encompassing people, process, and technology to create value for clients.",
          "linkedin": "https://www.linkedin.com/in/bob-sacco/"
        },
        "richard_w": {
          "name": "Richard Watts",
          "role": "Advisor",
          "bio": "Richard has spent his entire career working within the maritime industry with a particular focus on the carriage of physical commodities. {br} {br} After 7 years working for two of the leading independent rice trading companies, Richard created HR Maritime in 2008 in order to provide bespoke professional services and training to the Trading and Shipping Industry. HR Maritime enjoys a wide range of clients both in Geneva and in the wider Shipping and Trading Community. {br} {br} Richard has a passion for teaching and assisting companies to reduce inefficiencies wherever possible. Richard also works extensively with exporters and importers from less developed countries to help them access the global market and increase their involvement in the entire value chain. {br} {br} Richard is increasingly focusing on the requirements and opportunities presented by the need for decarbonisation and more generally achieving sustainability in the business of Trading, Shipping, Finance and supply chain logistics. {br} {br} Richard is the President of the Geneva branch of The Propeller Club and a Fellow of The Institute of Chartered Shipbrokers. Unrelated to his daily work but a source of immense pride, Richard is also the President of SOS Mediterrannee Suisse.",
          "linkedin": "https://www.linkedin.com/in/richard-watts-hr-maritime/"
        },
        "Leonardo_f": {
          "name": "Leonardo Ferrisi",
          "role": "Advisor, angel investor and Secretary",
          "bio": "New York-based, Leonardo has 20 years of experience as commercial and operational executive in cross border trade and maritime logistics. {br} Currently Global Sales Director with MSC, he previously held the role of Chief Commercial Officer and MD of the Caribbean for Svitzer, a subsidiary of the Maersk group. {br} {br} He formerly worked as VP of Operations for MSC US. Leonardo graduated from Harvard Business School, and he holds a MS in Naval Science from the Italian Naval Academy, being himself a retired IT Navy Lieutenant.",
          "linkedin": "https://www.linkedin.com/in/leonardo-f-305983116/"
        }
      }
    },
    "plan": {
      "2017": {
        "date": "2017",
        "status": "paste",
        "text": "Our vision is incepted by the founders in Manhattan, NYC"
      },
      "ARP-2021": {
        "date": "ARP 2021",
        "status": "active",
        "text": "Secro Inc. is incorporated"
      },
      "JAN-2022": {
        "date": "JAN 2022",
        "status": "future",
        "text": "First platform proof of concept​"
      },
      "OCT-22": {
        "date": "OCT 2022",
        "status": "future",
        "text": "First institutional funding round​"
      },
      "NOV-22": {
        "date": "NOV 2022",
        "status": "future",
        "text": "IGPI approval and BIMCO membership​​"
      },
      "DEC-22": {
        "date": "dec 2022",
        "status": "future",
        "text": "Secro e-Bill of Lading platform goes live​​"
      },
      "FEB-22": {
        "date": "Feb 2023",
        "status": "future",
        "text": "First transction in the world without private rulebook agreement​"
      }
    }
  },
  "howToUse": {
    "title": "HOW TO USE",
    "description": "Secro has a portfolio of products with unique depth and breadth of services, to support the most sophisticated cross-border trades. Yet, our platform is intuitive and easy to use: find how to make the best of our services below",
    "searchResults": "Search results",
    "navBar": {
      "title": "Navigation"
    },
    "resultEmpty": {
      "title": "No matches",
      "description1": "Unfortunately there is no results on your query.",
      "description2": "Please try a different one"
    }
  }
}
